import { FaqTs } from "@/core/assets/@types/faq";

export const faqDataAbout: FaqTs = {
  title: "سوالات متداول",
  faqs: [
    {
      id: 1,
      question: "درایور هاب چیست و چه کاری انجام می‌دهد؟",
      answer:
        "درایور هاب یک پلتفرم آنلاین برای رزرو نوبت آموزشگاه‌های رانندگی است. شما می‌توانید به راحتی نوبت خود را ثبت کنید، آموزشگر آن را مشاهده و تأیید کند، و در نهایت نوبت شما در پنل شخصی شما ثبت می‌شود.",
    },
    {
      id: 2,
      question: "چگونه می‌توانم نوبت آموزش رانندگی رزرو کنم؟",
      answer:
        "برای رزرو نوبت، وارد حساب کاربری خود شوید، آموزشگاه و آموزشگر مورد نظر خود را انتخاب کنید و زمان دلخواه را رزرو کنید. پس از تأیید آموزشگر در پنل خود، وضعیت نوبت شما «تأیید شده» نمایش داده می‌شود.",
    },
    {
      id: 3,
      question: "آیا آموزشگران می‌توانند نوبت‌ها را مدیریت کنند؟",
      answer:
        "بله، آموزشگران یک پنل اختصاصی دارند که در آن تمام درخواست‌های رزرو را مشاهده می‌کنند، می‌توانند نوبت‌ها را تأیید یا رد کنند و وضعیت جلسات را مدیریت نمایند.",
    },
    {
      id: 4,
      question: "اگر نیاز به تغییر زمان رزرو داشتم چه کنم؟",
      answer:
        "در صورت نیاز به تغییر زمان، می‌توانید از طریق پنل کاربری درخواست تغییر زمان را ثبت کنید. آموزشگر پس از مشاهده درخواست، در صورت امکان آن را تأیید خواهد کرد.",
    },
    {
      id: 5,
      question: "آیا استفاده از خدمات درایور هاب هزینه‌ای دارد؟",
      answer:
        "ثبت‌نام و مشاهده نوبت‌ها رایگان است. ممکن است هزینه‌های جزئی برای خدمات ویژه یا تأیید سریع‌تر وجود داشته باشد که در صفحه پلن‌ها ذکر شده است.",
    },
  ],
};
